grevaillot/svd_tools/headers/STM32H750x/mdma.h
#pragma once 

/* --- MDMA: MDMA --------------------------------------------------- */

/** @defgroup mdma_registers MDMA Register
@{*/

/** MDMA_MDMA_GISR0 MDMA Global Interrupt/Status Register **/
#define MDMA_MDMA_GISR0			MMIO32(MDMA_BASE + 0x00)
/** MDMA_MDMA_C0ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C0ISR			MMIO32(MDMA_BASE + 0x40)
/** MDMA_MDMA_C0IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C0IFCR			MMIO32(MDMA_BASE + 0x44)
/** MDMA_MDMA_C0ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C0ESR			MMIO32(MDMA_BASE + 0x48)
/** MDMA_MDMA_C0CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C0CR			MMIO32(MDMA_BASE + 0x4c)
/** MDMA_MDMA_C0TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C0TCR			MMIO32(MDMA_BASE + 0x50)
/** MDMA_MDMA_C0BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C0BNDTR			MMIO32(MDMA_BASE + 0x54)
/** MDMA_MDMA_C0SAR MDMA channel x source address register **/
#define MDMA_MDMA_C0SAR			MMIO32(MDMA_BASE + 0x58)
/** MDMA_MDMA_C0DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C0DAR			MMIO32(MDMA_BASE + 0x5c)
/** MDMA_MDMA_C0BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C0BRUR			MMIO32(MDMA_BASE + 0x60)
/** MDMA_MDMA_C0LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C0LAR			MMIO32(MDMA_BASE + 0x64)
/** MDMA_MDMA_C0TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C0TBR			MMIO32(MDMA_BASE + 0x68)
/** MDMA_MDMA_C0MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C0MAR			MMIO32(MDMA_BASE + 0x70)
/** MDMA_MDMA_C0MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C0MDR			MMIO32(MDMA_BASE + 0x74)
/** MDMA_MDMA_C1ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C1ISR			MMIO32(MDMA_BASE + 0x80)
/** MDMA_MDMA_C1IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C1IFCR			MMIO32(MDMA_BASE + 0x84)
/** MDMA_MDMA_C1ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C1ESR			MMIO32(MDMA_BASE + 0x88)
/** MDMA_MDMA_C1CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C1CR			MMIO32(MDMA_BASE + 0x8c)
/** MDMA_MDMA_C1TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C1TCR			MMIO32(MDMA_BASE + 0x90)
/** MDMA_MDMA_C1BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C1BNDTR			MMIO32(MDMA_BASE + 0x94)
/** MDMA_MDMA_C1SAR MDMA channel x source address register **/
#define MDMA_MDMA_C1SAR			MMIO32(MDMA_BASE + 0x98)
/** MDMA_MDMA_C1DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C1DAR			MMIO32(MDMA_BASE + 0x9c)
/** MDMA_MDMA_C1BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C1BRUR			MMIO32(MDMA_BASE + 0xa0)
/** MDMA_MDMA_C1LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C1LAR			MMIO32(MDMA_BASE + 0xa4)
/** MDMA_MDMA_C1TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C1TBR			MMIO32(MDMA_BASE + 0xa8)
/** MDMA_MDMA_C1MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C1MAR			MMIO32(MDMA_BASE + 0xb0)
/** MDMA_MDMA_C1MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C1MDR			MMIO32(MDMA_BASE + 0xb4)
/** MDMA_MDMA_C2ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C2ISR			MMIO32(MDMA_BASE + 0xc0)
/** MDMA_MDMA_C2IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C2IFCR			MMIO32(MDMA_BASE + 0xc4)
/** MDMA_MDMA_C2ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C2ESR			MMIO32(MDMA_BASE + 0xc8)
/** MDMA_MDMA_C2CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C2CR			MMIO32(MDMA_BASE + 0xcc)
/** MDMA_MDMA_C2TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C2TCR			MMIO32(MDMA_BASE + 0xd0)
/** MDMA_MDMA_C2BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C2BNDTR			MMIO32(MDMA_BASE + 0xd4)
/** MDMA_MDMA_C2SAR MDMA channel x source address register **/
#define MDMA_MDMA_C2SAR			MMIO32(MDMA_BASE + 0xd8)
/** MDMA_MDMA_C2DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C2DAR			MMIO32(MDMA_BASE + 0xdc)
/** MDMA_MDMA_C2BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C2BRUR			MMIO32(MDMA_BASE + 0xe0)
/** MDMA_MDMA_C2LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C2LAR			MMIO32(MDMA_BASE + 0xe4)
/** MDMA_MDMA_C2TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C2TBR			MMIO32(MDMA_BASE + 0xe8)
/** MDMA_MDMA_C2MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C2MAR			MMIO32(MDMA_BASE + 0xf0)
/** MDMA_MDMA_C2MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C2MDR			MMIO32(MDMA_BASE + 0xf4)
/** MDMA_MDMA_C3ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C3ISR			MMIO32(MDMA_BASE + 0x100)
/** MDMA_MDMA_C3IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C3IFCR			MMIO32(MDMA_BASE + 0x104)
/** MDMA_MDMA_C3ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C3ESR			MMIO32(MDMA_BASE + 0x108)
/** MDMA_MDMA_C3CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C3CR			MMIO32(MDMA_BASE + 0x10c)
/** MDMA_MDMA_C3TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C3TCR			MMIO32(MDMA_BASE + 0x110)
/** MDMA_MDMA_C3BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C3BNDTR			MMIO32(MDMA_BASE + 0x114)
/** MDMA_MDMA_C3SAR MDMA channel x source address register **/
#define MDMA_MDMA_C3SAR			MMIO32(MDMA_BASE + 0x118)
/** MDMA_MDMA_C3DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C3DAR			MMIO32(MDMA_BASE + 0x11c)
/** MDMA_MDMA_C3BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C3BRUR			MMIO32(MDMA_BASE + 0x120)
/** MDMA_MDMA_C3LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C3LAR			MMIO32(MDMA_BASE + 0x124)
/** MDMA_MDMA_C3TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C3TBR			MMIO32(MDMA_BASE + 0x128)
/** MDMA_MDMA_C3MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C3MAR			MMIO32(MDMA_BASE + 0x130)
/** MDMA_MDMA_C3MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C3MDR			MMIO32(MDMA_BASE + 0x134)
/** MDMA_MDMA_C4ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C4ISR			MMIO32(MDMA_BASE + 0x140)
/** MDMA_MDMA_C4IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C4IFCR			MMIO32(MDMA_BASE + 0x144)
/** MDMA_MDMA_C4ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C4ESR			MMIO32(MDMA_BASE + 0x148)
/** MDMA_MDMA_C4CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C4CR			MMIO32(MDMA_BASE + 0x14c)
/** MDMA_MDMA_C4TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C4TCR			MMIO32(MDMA_BASE + 0x150)
/** MDMA_MDMA_C4BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C4BNDTR			MMIO32(MDMA_BASE + 0x154)
/** MDMA_MDMA_C4SAR MDMA channel x source address register **/
#define MDMA_MDMA_C4SAR			MMIO32(MDMA_BASE + 0x158)
/** MDMA_MDMA_C4DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C4DAR			MMIO32(MDMA_BASE + 0x15c)
/** MDMA_MDMA_C4BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C4BRUR			MMIO32(MDMA_BASE + 0x160)
/** MDMA_MDMA_C4LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C4LAR			MMIO32(MDMA_BASE + 0x164)
/** MDMA_MDMA_C4TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C4TBR			MMIO32(MDMA_BASE + 0x168)
/** MDMA_MDMA_C4MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C4MAR			MMIO32(MDMA_BASE + 0x170)
/** MDMA_MDMA_C4MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C4MDR			MMIO32(MDMA_BASE + 0x174)
/** MDMA_MDMA_C5ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C5ISR			MMIO32(MDMA_BASE + 0x180)
/** MDMA_MDMA_C5IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C5IFCR			MMIO32(MDMA_BASE + 0x184)
/** MDMA_MDMA_C5ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C5ESR			MMIO32(MDMA_BASE + 0x188)
/** MDMA_MDMA_C5CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C5CR			MMIO32(MDMA_BASE + 0x18c)
/** MDMA_MDMA_C5TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C5TCR			MMIO32(MDMA_BASE + 0x190)
/** MDMA_MDMA_C5BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C5BNDTR			MMIO32(MDMA_BASE + 0x194)
/** MDMA_MDMA_C5SAR MDMA channel x source address register **/
#define MDMA_MDMA_C5SAR			MMIO32(MDMA_BASE + 0x198)
/** MDMA_MDMA_C5DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C5DAR			MMIO32(MDMA_BASE + 0x19c)
/** MDMA_MDMA_C5BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C5BRUR			MMIO32(MDMA_BASE + 0x1a0)
/** MDMA_MDMA_C5LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C5LAR			MMIO32(MDMA_BASE + 0x1a4)
/** MDMA_MDMA_C5TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C5TBR			MMIO32(MDMA_BASE + 0x1a8)
/** MDMA_MDMA_C5MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C5MAR			MMIO32(MDMA_BASE + 0x1b0)
/** MDMA_MDMA_C5MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C5MDR			MMIO32(MDMA_BASE + 0x1b4)
/** MDMA_MDMA_C6ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C6ISR			MMIO32(MDMA_BASE + 0x1c0)
/** MDMA_MDMA_C6IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C6IFCR			MMIO32(MDMA_BASE + 0x1c4)
/** MDMA_MDMA_C6ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C6ESR			MMIO32(MDMA_BASE + 0x1c8)
/** MDMA_MDMA_C6CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C6CR			MMIO32(MDMA_BASE + 0x1cc)
/** MDMA_MDMA_C6TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C6TCR			MMIO32(MDMA_BASE + 0x1d0)
/** MDMA_MDMA_C6BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C6BNDTR			MMIO32(MDMA_BASE + 0x1d4)
/** MDMA_MDMA_C6SAR MDMA channel x source address register **/
#define MDMA_MDMA_C6SAR			MMIO32(MDMA_BASE + 0x1d8)
/** MDMA_MDMA_C6DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C6DAR			MMIO32(MDMA_BASE + 0x1dc)
/** MDMA_MDMA_C6BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C6BRUR			MMIO32(MDMA_BASE + 0x1e0)
/** MDMA_MDMA_C6LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C6LAR			MMIO32(MDMA_BASE + 0x1e4)
/** MDMA_MDMA_C6TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C6TBR			MMIO32(MDMA_BASE + 0x1e8)
/** MDMA_MDMA_C6MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C6MAR			MMIO32(MDMA_BASE + 0x1f0)
/** MDMA_MDMA_C6MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C6MDR			MMIO32(MDMA_BASE + 0x1f4)
/** MDMA_MDMA_C7ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C7ISR			MMIO32(MDMA_BASE + 0x200)
/** MDMA_MDMA_C7IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C7IFCR			MMIO32(MDMA_BASE + 0x204)
/** MDMA_MDMA_C7ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C7ESR			MMIO32(MDMA_BASE + 0x208)
/** MDMA_MDMA_C7CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C7CR			MMIO32(MDMA_BASE + 0x20c)
/** MDMA_MDMA_C7TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C7TCR			MMIO32(MDMA_BASE + 0x210)
/** MDMA_MDMA_C7BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C7BNDTR			MMIO32(MDMA_BASE + 0x214)
/** MDMA_MDMA_C7SAR MDMA channel x source address register **/
#define MDMA_MDMA_C7SAR			MMIO32(MDMA_BASE + 0x218)
/** MDMA_MDMA_C7DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C7DAR			MMIO32(MDMA_BASE + 0x21c)
/** MDMA_MDMA_C7BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C7BRUR			MMIO32(MDMA_BASE + 0x220)
/** MDMA_MDMA_C7LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C7LAR			MMIO32(MDMA_BASE + 0x224)
/** MDMA_MDMA_C7TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C7TBR			MMIO32(MDMA_BASE + 0x228)
/** MDMA_MDMA_C7MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C7MAR			MMIO32(MDMA_BASE + 0x230)
/** MDMA_MDMA_C7MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C7MDR			MMIO32(MDMA_BASE + 0x234)
/** MDMA_MDMA_C8ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C8ISR			MMIO32(MDMA_BASE + 0x240)
/** MDMA_MDMA_C8IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C8IFCR			MMIO32(MDMA_BASE + 0x244)
/** MDMA_MDMA_C8ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C8ESR			MMIO32(MDMA_BASE + 0x248)
/** MDMA_MDMA_C8CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C8CR			MMIO32(MDMA_BASE + 0x24c)
/** MDMA_MDMA_C8TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C8TCR			MMIO32(MDMA_BASE + 0x250)
/** MDMA_MDMA_C8BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C8BNDTR			MMIO32(MDMA_BASE + 0x254)
/** MDMA_MDMA_C8SAR MDMA channel x source address register **/
#define MDMA_MDMA_C8SAR			MMIO32(MDMA_BASE + 0x258)
/** MDMA_MDMA_C8DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C8DAR			MMIO32(MDMA_BASE + 0x25c)
/** MDMA_MDMA_C8BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C8BRUR			MMIO32(MDMA_BASE + 0x260)
/** MDMA_MDMA_C8LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C8LAR			MMIO32(MDMA_BASE + 0x264)
/** MDMA_MDMA_C8TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C8TBR			MMIO32(MDMA_BASE + 0x268)
/** MDMA_MDMA_C8MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C8MAR			MMIO32(MDMA_BASE + 0x270)
/** MDMA_MDMA_C8MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C8MDR			MMIO32(MDMA_BASE + 0x274)
/** MDMA_MDMA_C9ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C9ISR			MMIO32(MDMA_BASE + 0x280)
/** MDMA_MDMA_C9IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C9IFCR			MMIO32(MDMA_BASE + 0x284)
/** MDMA_MDMA_C9ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C9ESR			MMIO32(MDMA_BASE + 0x288)
/** MDMA_MDMA_C9CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C9CR			MMIO32(MDMA_BASE + 0x28c)
/** MDMA_MDMA_C9TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C9TCR			MMIO32(MDMA_BASE + 0x290)
/** MDMA_MDMA_C9BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C9BNDTR			MMIO32(MDMA_BASE + 0x294)
/** MDMA_MDMA_C9SAR MDMA channel x source address register **/
#define MDMA_MDMA_C9SAR			MMIO32(MDMA_BASE + 0x298)
/** MDMA_MDMA_C9DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C9DAR			MMIO32(MDMA_BASE + 0x29c)
/** MDMA_MDMA_C9BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C9BRUR			MMIO32(MDMA_BASE + 0x2a0)
/** MDMA_MDMA_C9LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C9LAR			MMIO32(MDMA_BASE + 0x2a4)
/** MDMA_MDMA_C9TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C9TBR			MMIO32(MDMA_BASE + 0x2a8)
/** MDMA_MDMA_C9MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C9MAR			MMIO32(MDMA_BASE + 0x2b0)
/** MDMA_MDMA_C9MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C9MDR			MMIO32(MDMA_BASE + 0x2b4)
/** MDMA_MDMA_C10ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C10ISR			MMIO32(MDMA_BASE + 0x2c0)
/** MDMA_MDMA_C10IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C10IFCR			MMIO32(MDMA_BASE + 0x2c4)
/** MDMA_MDMA_C10ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C10ESR			MMIO32(MDMA_BASE + 0x2c8)
/** MDMA_MDMA_C10CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C10CR			MMIO32(MDMA_BASE + 0x2cc)
/** MDMA_MDMA_C10TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C10TCR			MMIO32(MDMA_BASE + 0x2d0)
/** MDMA_MDMA_C10BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C10BNDTR			MMIO32(MDMA_BASE + 0x2d4)
/** MDMA_MDMA_C10SAR MDMA channel x source address register **/
#define MDMA_MDMA_C10SAR			MMIO32(MDMA_BASE + 0x2d8)
/** MDMA_MDMA_C10DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C10DAR			MMIO32(MDMA_BASE + 0x2dc)
/** MDMA_MDMA_C10BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C10BRUR			MMIO32(MDMA_BASE + 0x2e0)
/** MDMA_MDMA_C10LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C10LAR			MMIO32(MDMA_BASE + 0x2e4)
/** MDMA_MDMA_C10TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C10TBR			MMIO32(MDMA_BASE + 0x2e8)
/** MDMA_MDMA_C10MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C10MAR			MMIO32(MDMA_BASE + 0x2f0)
/** MDMA_MDMA_C10MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C10MDR			MMIO32(MDMA_BASE + 0x2f4)
/** MDMA_MDMA_C11ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C11ISR			MMIO32(MDMA_BASE + 0x300)
/** MDMA_MDMA_C11IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C11IFCR			MMIO32(MDMA_BASE + 0x304)
/** MDMA_MDMA_C11ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C11ESR			MMIO32(MDMA_BASE + 0x308)
/** MDMA_MDMA_C11CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C11CR			MMIO32(MDMA_BASE + 0x30c)
/** MDMA_MDMA_C11TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C11TCR			MMIO32(MDMA_BASE + 0x310)
/** MDMA_MDMA_C11BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C11BNDTR			MMIO32(MDMA_BASE + 0x314)
/** MDMA_MDMA_C11SAR MDMA channel x source address register **/
#define MDMA_MDMA_C11SAR			MMIO32(MDMA_BASE + 0x318)
/** MDMA_MDMA_C11DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C11DAR			MMIO32(MDMA_BASE + 0x31c)
/** MDMA_MDMA_C11BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C11BRUR			MMIO32(MDMA_BASE + 0x320)
/** MDMA_MDMA_C11LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C11LAR			MMIO32(MDMA_BASE + 0x324)
/** MDMA_MDMA_C11TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C11TBR			MMIO32(MDMA_BASE + 0x328)
/** MDMA_MDMA_C11MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C11MAR			MMIO32(MDMA_BASE + 0x330)
/** MDMA_MDMA_C11MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C11MDR			MMIO32(MDMA_BASE + 0x334)
/** MDMA_MDMA_C12ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C12ISR			MMIO32(MDMA_BASE + 0x340)
/** MDMA_MDMA_C12IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C12IFCR			MMIO32(MDMA_BASE + 0x344)
/** MDMA_MDMA_C12ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C12ESR			MMIO32(MDMA_BASE + 0x348)
/** MDMA_MDMA_C12CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C12CR			MMIO32(MDMA_BASE + 0x34c)
/** MDMA_MDMA_C12TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C12TCR			MMIO32(MDMA_BASE + 0x350)
/** MDMA_MDMA_C12BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C12BNDTR			MMIO32(MDMA_BASE + 0x354)
/** MDMA_MDMA_C12SAR MDMA channel x source address register **/
#define MDMA_MDMA_C12SAR			MMIO32(MDMA_BASE + 0x358)
/** MDMA_MDMA_C12DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C12DAR			MMIO32(MDMA_BASE + 0x35c)
/** MDMA_MDMA_C12BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C12BRUR			MMIO32(MDMA_BASE + 0x360)
/** MDMA_MDMA_C12LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C12LAR			MMIO32(MDMA_BASE + 0x364)
/** MDMA_MDMA_C12TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C12TBR			MMIO32(MDMA_BASE + 0x368)
/** MDMA_MDMA_C12MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C12MAR			MMIO32(MDMA_BASE + 0x370)
/** MDMA_MDMA_C12MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C12MDR			MMIO32(MDMA_BASE + 0x374)
/** MDMA_MDMA_C13ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C13ISR			MMIO32(MDMA_BASE + 0x380)
/** MDMA_MDMA_C13IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C13IFCR			MMIO32(MDMA_BASE + 0x384)
/** MDMA_MDMA_C13ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C13ESR			MMIO32(MDMA_BASE + 0x388)
/** MDMA_MDMA_C13CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C13CR			MMIO32(MDMA_BASE + 0x38c)
/** MDMA_MDMA_C13TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C13TCR			MMIO32(MDMA_BASE + 0x390)
/** MDMA_MDMA_C13BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C13BNDTR			MMIO32(MDMA_BASE + 0x394)
/** MDMA_MDMA_C13SAR MDMA channel x source address register **/
#define MDMA_MDMA_C13SAR			MMIO32(MDMA_BASE + 0x398)
/** MDMA_MDMA_C13DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C13DAR			MMIO32(MDMA_BASE + 0x39c)
/** MDMA_MDMA_C13BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C13BRUR			MMIO32(MDMA_BASE + 0x3a0)
/** MDMA_MDMA_C13LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C13LAR			MMIO32(MDMA_BASE + 0x3a4)
/** MDMA_MDMA_C13TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C13TBR			MMIO32(MDMA_BASE + 0x3a8)
/** MDMA_MDMA_C13MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C13MAR			MMIO32(MDMA_BASE + 0x3b0)
/** MDMA_MDMA_C13MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C13MDR			MMIO32(MDMA_BASE + 0x3b4)
/** MDMA_MDMA_C14ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C14ISR			MMIO32(MDMA_BASE + 0x3c0)
/** MDMA_MDMA_C14IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C14IFCR			MMIO32(MDMA_BASE + 0x3c4)
/** MDMA_MDMA_C14ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C14ESR			MMIO32(MDMA_BASE + 0x3c8)
/** MDMA_MDMA_C14CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C14CR			MMIO32(MDMA_BASE + 0x3cc)
/** MDMA_MDMA_C14TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C14TCR			MMIO32(MDMA_BASE + 0x3d0)
/** MDMA_MDMA_C14BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C14BNDTR			MMIO32(MDMA_BASE + 0x3d4)
/** MDMA_MDMA_C14SAR MDMA channel x source address register **/
#define MDMA_MDMA_C14SAR			MMIO32(MDMA_BASE + 0x3d8)
/** MDMA_MDMA_C14DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C14DAR			MMIO32(MDMA_BASE + 0x3dc)
/** MDMA_MDMA_C14BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C14BRUR			MMIO32(MDMA_BASE + 0x3e0)
/** MDMA_MDMA_C14LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C14LAR			MMIO32(MDMA_BASE + 0x3e4)
/** MDMA_MDMA_C14TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C14TBR			MMIO32(MDMA_BASE + 0x3e8)
/** MDMA_MDMA_C14MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C14MAR			MMIO32(MDMA_BASE + 0x3f0)
/** MDMA_MDMA_C14MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C14MDR			MMIO32(MDMA_BASE + 0x3f4)
/** MDMA_MDMA_C15ISR MDMA channel x interrupt/status register **/
#define MDMA_MDMA_C15ISR			MMIO32(MDMA_BASE + 0x400)
