grevaillot/svd_tools/headers/STM32H750x/mdma.h
/** MDMA_MDMA_C15IFCR MDMA channel x interrupt flag clear register **/
#define MDMA_MDMA_C15IFCR			MMIO32(MDMA_BASE + 0x404)
/** MDMA_MDMA_C15ESR MDMA Channel x error status register **/
#define MDMA_MDMA_C15ESR			MMIO32(MDMA_BASE + 0x408)
/** MDMA_MDMA_C15CR This register is used to control the concerned channel. **/
#define MDMA_MDMA_C15CR			MMIO32(MDMA_BASE + 0x40c)
/** MDMA_MDMA_C15TCR This register is used to configure the concerned channel. **/
#define MDMA_MDMA_C15TCR			MMIO32(MDMA_BASE + 0x410)
/** MDMA_MDMA_C15BNDTR MDMA Channel x block number of data register **/
#define MDMA_MDMA_C15BNDTR			MMIO32(MDMA_BASE + 0x414)
/** MDMA_MDMA_C15SAR MDMA channel x source address register **/
#define MDMA_MDMA_C15SAR			MMIO32(MDMA_BASE + 0x418)
/** MDMA_MDMA_C15DAR MDMA channel x destination address register **/
#define MDMA_MDMA_C15DAR			MMIO32(MDMA_BASE + 0x41c)
/** MDMA_MDMA_C15BRUR MDMA channel x Block Repeat address Update register **/
#define MDMA_MDMA_C15BRUR			MMIO32(MDMA_BASE + 0x420)
/** MDMA_MDMA_C15LAR MDMA channel x Link Address register **/
#define MDMA_MDMA_C15LAR			MMIO32(MDMA_BASE + 0x424)
/** MDMA_MDMA_C15TBR MDMA channel x Trigger and Bus selection Register **/
#define MDMA_MDMA_C15TBR			MMIO32(MDMA_BASE + 0x428)
/** MDMA_MDMA_C15MAR MDMA channel x Mask address register **/
#define MDMA_MDMA_C15MAR			MMIO32(MDMA_BASE + 0x430)
/** MDMA_MDMA_C15MDR MDMA channel x Mask Data register **/
#define MDMA_MDMA_C15MDR			MMIO32(MDMA_BASE + 0x434)

/**@}*/


/** @defgroup mdma_mdma_gisr0 MDMAGISR0 MDMA Global Interrupt/Status Register
@{*/

/** MDMA_MDMA_GISR0_GIF15 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF15		(1 << 15)
/** MDMA_MDMA_GISR0_GIF14 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF14		(1 << 14)
/** MDMA_MDMA_GISR0_GIF13 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF13		(1 << 13)
/** MDMA_MDMA_GISR0_GIF12 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF12		(1 << 12)
/** MDMA_MDMA_GISR0_GIF11 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF11		(1 << 11)
/** MDMA_MDMA_GISR0_GIF10 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF10		(1 << 10)
/** MDMA_MDMA_GISR0_GIF9 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF9		(1 << 9)
/** MDMA_MDMA_GISR0_GIF8 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF8		(1 << 8)
/** MDMA_MDMA_GISR0_GIF7 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF7		(1 << 7)
/** MDMA_MDMA_GISR0_GIF6 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF6		(1 << 6)
/** MDMA_MDMA_GISR0_GIF5 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF5		(1 << 5)
/** MDMA_MDMA_GISR0_GIF4 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF4		(1 << 4)
/** MDMA_MDMA_GISR0_GIF3 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF3		(1 << 3)
/** MDMA_MDMA_GISR0_GIF2 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF2		(1 << 2)
/** MDMA_MDMA_GISR0_GIF1 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF1		(1 << 1)
/** MDMA_MDMA_GISR0_GIF0 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_MDMA_GISR0_GIF0		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c0isr MDMAC0ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C0ISR_CRQA0 channel x request active flag **/
#define MDMA_MDMA_C0ISR_CRQA0		(1 << 16)
/** MDMA_MDMA_C0ISR_TCIF0 channel x buffer transfer complete **/
#define MDMA_MDMA_C0ISR_TCIF0		(1 << 4)
/** MDMA_MDMA_C0ISR_BTIF0 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C0ISR_BTIF0		(1 << 3)
/** MDMA_MDMA_C0ISR_BRTIF0 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C0ISR_BRTIF0		(1 << 2)
/** MDMA_MDMA_C0ISR_CTCIF0 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C0ISR_CTCIF0		(1 << 1)
/** MDMA_MDMA_C0ISR_TEIF0 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C0ISR_TEIF0		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c0ifcr MDMAC0IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C0IFCR_CLTCIF0 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C0IFCR_CLTCIF0		(1 << 4)
/** MDMA_MDMA_C0IFCR_CBTIF0 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C0IFCR_CBTIF0		(1 << 3)
/** MDMA_MDMA_C0IFCR_CBRTIF0 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C0IFCR_CBRTIF0		(1 << 2)
/** MDMA_MDMA_C0IFCR_CCTCIF0 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C0IFCR_CCTCIF0		(1 << 1)
/** MDMA_MDMA_C0IFCR_CTEIF0 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C0IFCR_CTEIF0		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c0esr MDMAC0ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C0ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C0ESR_BSE		(1 << 11)
/** MDMA_MDMA_C0ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C0ESR_ASE		(1 << 10)
/** MDMA_MDMA_C0ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C0ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C0ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C0ESR_TELD		(1 << 8)
/** MDMA_MDMA_C0ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C0ESR_TED		(1 << 7)

