grevaillot/svd_tools/headers/STM32H750x/mdma.h
/** @defgroup mdma_mdma_c0dar MDMAC0DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C0DAR_DAR_SHIFT		0
#define MDMA_MDMA_C0DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c0dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c0brur MDMAC0BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C0BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C0BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c0brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C0BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C0BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c0brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c0lar MDMAC0LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C0LAR_LAR_SHIFT		0
#define MDMA_MDMA_C0LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c0lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c0tbr MDMAC0TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C0TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C0TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C0TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C0TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C0TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C0TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c0tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c0mar MDMAC0MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C0MAR_MAR_SHIFT		0
#define MDMA_MDMA_C0MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c0mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c0mdr MDMAC0MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C0MDR_MDR_SHIFT		0
#define MDMA_MDMA_C0MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c0mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c1isr MDMAC1ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C1ISR_CRQA1 channel x request active flag **/
#define MDMA_MDMA_C1ISR_CRQA1		(1 << 16)
/** MDMA_MDMA_C1ISR_TCIF1 channel x buffer transfer complete **/
#define MDMA_MDMA_C1ISR_TCIF1		(1 << 4)
/** MDMA_MDMA_C1ISR_BTIF1 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C1ISR_BTIF1		(1 << 3)
/** MDMA_MDMA_C1ISR_BRTIF1 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C1ISR_BRTIF1		(1 << 2)
/** MDMA_MDMA_C1ISR_CTCIF1 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C1ISR_CTCIF1		(1 << 1)
/** MDMA_MDMA_C1ISR_TEIF1 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C1ISR_TEIF1		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c1ifcr MDMAC1IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C1IFCR_CLTCIF1 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C1IFCR_CLTCIF1		(1 << 4)
/** MDMA_MDMA_C1IFCR_CBTIF1 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C1IFCR_CBTIF1		(1 << 3)
/** MDMA_MDMA_C1IFCR_CBRTIF1 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C1IFCR_CBRTIF1		(1 << 2)
/** MDMA_MDMA_C1IFCR_CCTCIF1 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C1IFCR_CCTCIF1		(1 << 1)
/** MDMA_MDMA_C1IFCR_CTEIF1 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C1IFCR_CTEIF1		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c1esr MDMAC1ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C1ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C1ESR_BSE		(1 << 11)
/** MDMA_MDMA_C1ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C1ESR_ASE		(1 << 10)
/** MDMA_MDMA_C1ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C1ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C1ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C1ESR_TELD		(1 << 8)
/** MDMA_MDMA_C1ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C1ESR_TED		(1 << 7)

#define MDMA_MDMA_C1ESR_TEA_SHIFT		0
#define MDMA_MDMA_C1ESR_TEA_MASK		0x7f
/** @defgroup mdma_mdma_c1esr_tea TEA Transfer Error Address These bits are set and cleared by HW, in case of an MDMA data transfer error. It is used in conjunction with TED. This field indicates the 7 LSBits of the address which generated a transfer/access error. It may be used by SW to retrieve the failing address, by adding this value (truncated to the buffer transfer length size) to the current SAR/DAR value. Note: The SAR/DAR current value doesnt reflect this last address due to the FIFO management system. The SAR/DAR are only updated at the end of a (buffer) transfer (of TLEN+1 bytes). Note: It is not set in case of a link data error.
@{*/
/**@}*/


/**@}*/

