grevaillot/svd_tools/headers/STM32H750x/mdma.h
#define MDMA_MDMA_C3BNDTR_BRC_SHIFT		20
#define MDMA_MDMA_C3BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_mdma_c3bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_MDMA_C3BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C3BNDTR_BRDUM		(1 << 19)
/** MDMA_MDMA_C3BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C3BNDTR_BRSUM		(1 << 18)

#define MDMA_MDMA_C3BNDTR_BNDT_SHIFT		0
#define MDMA_MDMA_C3BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_mdma_c3bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c3sar MDMAC3SAR MDMA channel x source address register
@{*/


#define MDMA_MDMA_C3SAR_SAR_SHIFT		0
#define MDMA_MDMA_C3SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c3sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c3dar MDMAC3DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C3DAR_DAR_SHIFT		0
#define MDMA_MDMA_C3DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c3dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c3brur MDMAC3BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C3BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C3BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c3brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C3BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C3BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c3brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c3lar MDMAC3LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C3LAR_LAR_SHIFT		0
#define MDMA_MDMA_C3LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c3lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c3tbr MDMAC3TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C3TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C3TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C3TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C3TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C3TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C3TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c3tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c3mar MDMAC3MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C3MAR_MAR_SHIFT		0
#define MDMA_MDMA_C3MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c3mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c3mdr MDMAC3MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C3MDR_MDR_SHIFT		0
#define MDMA_MDMA_C3MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c3mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c4isr MDMAC4ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C4ISR_CRQA4 channel x request active flag **/
#define MDMA_MDMA_C4ISR_CRQA4		(1 << 16)
/** MDMA_MDMA_C4ISR_TCIF4 channel x buffer transfer complete **/
#define MDMA_MDMA_C4ISR_TCIF4		(1 << 4)
/** MDMA_MDMA_C4ISR_BTIF4 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C4ISR_BTIF4		(1 << 3)
/** MDMA_MDMA_C4ISR_BRTIF4 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C4ISR_BRTIF4		(1 << 2)
/** MDMA_MDMA_C4ISR_CTCIF4 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C4ISR_CTCIF4		(1 << 1)
/** MDMA_MDMA_C4ISR_TEIF4 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C4ISR_TEIF4		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c4ifcr MDMAC4IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C4IFCR_CLTCIF4 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C4IFCR_CLTCIF4		(1 << 4)
/** MDMA_MDMA_C4IFCR_CBTIF4 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C4IFCR_CBTIF4		(1 << 3)
/** MDMA_MDMA_C4IFCR_CBRTIF4 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C4IFCR_CBRTIF4		(1 << 2)
/** MDMA_MDMA_C4IFCR_CCTCIF4 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C4IFCR_CCTCIF4		(1 << 1)
/** MDMA_MDMA_C4IFCR_CTEIF4 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C4IFCR_CTEIF4		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c4esr MDMAC4ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C4ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C4ESR_BSE		(1 << 11)
/** MDMA_MDMA_C4ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C4ESR_ASE		(1 << 10)
/** MDMA_MDMA_C4ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C4ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C4ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C4ESR_TELD		(1 << 8)
/** MDMA_MDMA_C4ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C4ESR_TED		(1 << 7)

#define MDMA_MDMA_C4ESR_TEA_SHIFT		0
#define MDMA_MDMA_C4ESR_TEA_MASK		0x7f
/** @defgroup mdma_mdma_c4esr_tea TEA Transfer Error Address These bits are set and cleared by HW, in case of an MDMA data transfer error. It is used in conjunction with TED. This field indicates the 7 LSBits of the address which generated a transfer/access error. It may be used by SW to retrieve the failing address, by adding this value (truncated to the buffer transfer length size) to the current SAR/DAR value. Note: The SAR/DAR current value doesnt reflect this last address due to the FIFO management system. The SAR/DAR are only updated at the end of a (buffer) transfer (of TLEN+1 bytes). Note: It is not set in case of a link data error.
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c4cr MDMAC4CR This register is used to control the concerned channel.
@{*/

/** MDMA_MDMA_C4CR_SWRQ SW ReQuest Writing a 1 into this bit sets the CRQAx in MDMA_ISRy register, activating the request on Channel x Note: Either the whole CxCR register or the 8-bit/16-bit register @ Address offset: 0x4E + 0x40 chn may be used for SWRQ activation. In case of a SW request, acknowledge is not generated (neither HW signal, nor CxMAR write access). **/
#define MDMA_MDMA_C4CR_SWRQ		(1 << 16)
/** MDMA_MDMA_C4CR_WEX Word Endianness exchange **/
#define MDMA_MDMA_C4CR_WEX		(1 << 14)
/** MDMA_MDMA_C4CR_HEX Half word Endianes exchange **/
#define MDMA_MDMA_C4CR_HEX		(1 << 13)
/** MDMA_MDMA_C4CR_BEX byte Endianness exchange **/
#define MDMA_MDMA_C4CR_BEX		(1 << 12)

#define MDMA_MDMA_C4CR_PL_SHIFT		6
#define MDMA_MDMA_C4CR_PL_MASK		0x03
/** @defgroup mdma_mdma_c4cr_pl PL Priority level These bits are set and cleared by software. These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_MDMA_C4CR_TCIE buffer Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C4CR_TCIE		(1 << 5)
/** MDMA_MDMA_C4CR_BTIE Block Transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C4CR_BTIE		(1 << 4)
/** MDMA_MDMA_C4CR_BRTIE Block Repeat transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C4CR_BRTIE		(1 << 3)
/** MDMA_MDMA_C4CR_CTCIE Channel Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C4CR_CTCIE		(1 << 2)
/** MDMA_MDMA_C4CR_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C4CR_TEIE		(1 << 1)
/** MDMA_MDMA_C4CR_EN channel enable **/
#define MDMA_MDMA_C4CR_EN		(1 << 0)

/**@}*/

