grevaillot/svd_tools/headers/STM32H750x/mdma.h
#define MDMA_MDMA_C4LAR_LAR_SHIFT		0
#define MDMA_MDMA_C4LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c4lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c4tbr MDMAC4TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C4TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C4TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C4TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C4TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C4TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C4TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c4tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c4mar MDMAC4MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C4MAR_MAR_SHIFT		0
#define MDMA_MDMA_C4MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c4mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c4mdr MDMAC4MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C4MDR_MDR_SHIFT		0
#define MDMA_MDMA_C4MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c4mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5isr MDMAC5ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C5ISR_CRQA5 channel x request active flag **/
#define MDMA_MDMA_C5ISR_CRQA5		(1 << 16)
/** MDMA_MDMA_C5ISR_TCIF5 channel x buffer transfer complete **/
#define MDMA_MDMA_C5ISR_TCIF5		(1 << 4)
/** MDMA_MDMA_C5ISR_BTIF5 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C5ISR_BTIF5		(1 << 3)
/** MDMA_MDMA_C5ISR_BRTIF5 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C5ISR_BRTIF5		(1 << 2)
/** MDMA_MDMA_C5ISR_CTCIF5 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C5ISR_CTCIF5		(1 << 1)
/** MDMA_MDMA_C5ISR_TEIF5 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C5ISR_TEIF5		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c5ifcr MDMAC5IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C5IFCR_CLTCIF5 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C5IFCR_CLTCIF5		(1 << 4)
/** MDMA_MDMA_C5IFCR_CBTIF5 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C5IFCR_CBTIF5		(1 << 3)
/** MDMA_MDMA_C5IFCR_CBRTIF5 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C5IFCR_CBRTIF5		(1 << 2)
/** MDMA_MDMA_C5IFCR_CCTCIF5 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C5IFCR_CCTCIF5		(1 << 1)
/** MDMA_MDMA_C5IFCR_CTEIF5 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C5IFCR_CTEIF5		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c5esr MDMAC5ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C5ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C5ESR_BSE		(1 << 11)
/** MDMA_MDMA_C5ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C5ESR_ASE		(1 << 10)
/** MDMA_MDMA_C5ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C5ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C5ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C5ESR_TELD		(1 << 8)
/** MDMA_MDMA_C5ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C5ESR_TED		(1 << 7)

#define MDMA_MDMA_C5ESR_TEA_SHIFT		0
#define MDMA_MDMA_C5ESR_TEA_MASK		0x7f
/** @defgroup mdma_mdma_c5esr_tea TEA Transfer Error Address These bits are set and cleared by HW, in case of an MDMA data transfer error. It is used in conjunction with TED. This field indicates the 7 LSBits of the address which generated a transfer/access error. It may be used by SW to retrieve the failing address, by adding this value (truncated to the buffer transfer length size) to the current SAR/DAR value. Note: The SAR/DAR current value doesnt reflect this last address due to the FIFO management system. The SAR/DAR are only updated at the end of a (buffer) transfer (of TLEN+1 bytes). Note: It is not set in case of a link data error.
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5cr MDMAC5CR This register is used to control the concerned channel.
@{*/

