grevaillot/svd_tools/headers/STM32H750x/mdma.h
#define MDMA_MDMA_C5TCR_SINC_SHIFT		0
#define MDMA_MDMA_C5TCR_SINC_MASK		0x03
/** @defgroup mdma_mdma_c5tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5bndtr MDMAC5BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_MDMA_C5BNDTR_BRC_SHIFT		20
#define MDMA_MDMA_C5BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_mdma_c5bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_MDMA_C5BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C5BNDTR_BRDUM		(1 << 19)
/** MDMA_MDMA_C5BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C5BNDTR_BRSUM		(1 << 18)

#define MDMA_MDMA_C5BNDTR_BNDT_SHIFT		0
#define MDMA_MDMA_C5BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_mdma_c5bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5sar MDMAC5SAR MDMA channel x source address register
@{*/


#define MDMA_MDMA_C5SAR_SAR_SHIFT		0
#define MDMA_MDMA_C5SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c5sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5dar MDMAC5DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C5DAR_DAR_SHIFT		0
#define MDMA_MDMA_C5DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c5dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5brur MDMAC5BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C5BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C5BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c5brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C5BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C5BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c5brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5lar MDMAC5LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C5LAR_LAR_SHIFT		0
#define MDMA_MDMA_C5LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c5lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5tbr MDMAC5TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C5TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C5TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C5TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C5TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C5TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C5TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c5tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5mar MDMAC5MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C5MAR_MAR_SHIFT		0
#define MDMA_MDMA_C5MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c5mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c5mdr MDMAC5MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C5MDR_MDR_SHIFT		0
#define MDMA_MDMA_C5MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c5mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6isr MDMAC6ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C6ISR_CRQA6 channel x request active flag **/
#define MDMA_MDMA_C6ISR_CRQA6		(1 << 16)
/** MDMA_MDMA_C6ISR_TCIF6 channel x buffer transfer complete **/
#define MDMA_MDMA_C6ISR_TCIF6		(1 << 4)
/** MDMA_MDMA_C6ISR_BTIF6 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C6ISR_BTIF6		(1 << 3)
/** MDMA_MDMA_C6ISR_BRTIF6 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C6ISR_BRTIF6		(1 << 2)
/** MDMA_MDMA_C6ISR_CTCIF6 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C6ISR_CTCIF6		(1 << 1)
/** MDMA_MDMA_C6ISR_TEIF6 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C6ISR_TEIF6		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c6ifcr MDMAC6IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C6IFCR_CLTCIF6 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C6IFCR_CLTCIF6		(1 << 4)
/** MDMA_MDMA_C6IFCR_CBTIF6 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C6IFCR_CBTIF6		(1 << 3)
/** MDMA_MDMA_C6IFCR_CBRTIF6 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C6IFCR_CBRTIF6		(1 << 2)
/** MDMA_MDMA_C6IFCR_CCTCIF6 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C6IFCR_CCTCIF6		(1 << 1)
/** MDMA_MDMA_C6IFCR_CTEIF6 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C6IFCR_CTEIF6		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c6esr MDMAC6ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C6ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C6ESR_BSE		(1 << 11)
/** MDMA_MDMA_C6ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C6ESR_ASE		(1 << 10)
/** MDMA_MDMA_C6ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C6ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C6ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C6ESR_TELD		(1 << 8)
/** MDMA_MDMA_C6ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C6ESR_TED		(1 << 7)

