grevaillot/svd_tools/headers/STM32H750x/mdma.h
#define MDMA_MDMA_C6TCR_DINC_SHIFT		2
#define MDMA_MDMA_C6TCR_DINC_MASK		0x03
/** @defgroup mdma_mdma_c6tcr_dinc DINC Destination increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When destination is AHB (DBUS=1), DINC = 00 is forbidden.
@{*/
/**@}*/


#define MDMA_MDMA_C6TCR_SINC_SHIFT		0
#define MDMA_MDMA_C6TCR_SINC_MASK		0x03
/** @defgroup mdma_mdma_c6tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6bndtr MDMAC6BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_MDMA_C6BNDTR_BRC_SHIFT		20
#define MDMA_MDMA_C6BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_mdma_c6bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0
@{*/
/**@}*/

/** MDMA_MDMA_C6BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C6BNDTR_BRDUM		(1 << 19)
/** MDMA_MDMA_C6BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C6BNDTR_BRSUM		(1 << 18)

#define MDMA_MDMA_C6BNDTR_BNDT_SHIFT		0
#define MDMA_MDMA_C6BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_mdma_c6bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6sar MDMAC6SAR MDMA channel x source address register
@{*/


#define MDMA_MDMA_C6SAR_SAR_SHIFT		0
#define MDMA_MDMA_C6SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c6sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6dar MDMAC6DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C6DAR_DAR_SHIFT		0
#define MDMA_MDMA_C6DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c6dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6brur MDMAC6BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C6BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C6BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c6brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C6BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C6BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c6brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6lar MDMAC6LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C6LAR_LAR_SHIFT		0
#define MDMA_MDMA_C6LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c6lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6tbr MDMAC6TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C6TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C6TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C6TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C6TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C6TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C6TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c6tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6mar MDMAC6MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C6MAR_MAR_SHIFT		0
#define MDMA_MDMA_C6MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c6mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c6mdr MDMAC6MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C6MDR_MDR_SHIFT		0
#define MDMA_MDMA_C6MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c6mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c7isr MDMAC7ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C7ISR_CRQA7 channel x request active flag **/
#define MDMA_MDMA_C7ISR_CRQA7		(1 << 16)
/** MDMA_MDMA_C7ISR_TCIF7 channel x buffer transfer complete **/
#define MDMA_MDMA_C7ISR_TCIF7		(1 << 4)
/** MDMA_MDMA_C7ISR_BTIF7 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C7ISR_BTIF7		(1 << 3)
/** MDMA_MDMA_C7ISR_BRTIF7 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C7ISR_BRTIF7		(1 << 2)
/** MDMA_MDMA_C7ISR_CTCIF7 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C7ISR_CTCIF7		(1 << 1)
/** MDMA_MDMA_C7ISR_TEIF7 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C7ISR_TEIF7		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c7ifcr MDMAC7IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C7IFCR_CLTCIF7 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C7IFCR_CLTCIF7		(1 << 4)
/** MDMA_MDMA_C7IFCR_CBTIF7 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C7IFCR_CBTIF7		(1 << 3)
/** MDMA_MDMA_C7IFCR_CBRTIF7 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C7IFCR_CBRTIF7		(1 << 2)
/** MDMA_MDMA_C7IFCR_CCTCIF7 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C7IFCR_CCTCIF7		(1 << 1)
/** MDMA_MDMA_C7IFCR_CTEIF7 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C7IFCR_CTEIF7		(1 << 0)

/**@}*/

