grevaillot/svd_tools/headers/STM32H750x/mdma.h
#define MDMA_MDMA_C8BNDTR_BNDT_SHIFT		0
#define MDMA_MDMA_C8BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_mdma_c8bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c8sar MDMAC8SAR MDMA channel x source address register
@{*/


#define MDMA_MDMA_C8SAR_SAR_SHIFT		0
#define MDMA_MDMA_C8SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c8sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c8dar MDMAC8DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C8DAR_DAR_SHIFT		0
#define MDMA_MDMA_C8DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c8dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c8brur MDMAC8BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C8BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C8BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c8brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C8BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C8BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c8brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c8lar MDMAC8LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C8LAR_LAR_SHIFT		0
#define MDMA_MDMA_C8LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c8lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c8tbr MDMAC8TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C8TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C8TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C8TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C8TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C8TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C8TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c8tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c8mar MDMAC8MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C8MAR_MAR_SHIFT		0
#define MDMA_MDMA_C8MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c8mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c8mdr MDMAC8MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C8MDR_MDR_SHIFT		0
#define MDMA_MDMA_C8MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c8mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c9isr MDMAC9ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C9ISR_CRQA9 channel x request active flag **/
#define MDMA_MDMA_C9ISR_CRQA9		(1 << 16)
/** MDMA_MDMA_C9ISR_TCIF9 channel x buffer transfer complete **/
#define MDMA_MDMA_C9ISR_TCIF9		(1 << 4)
/** MDMA_MDMA_C9ISR_BTIF9 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C9ISR_BTIF9		(1 << 3)
/** MDMA_MDMA_C9ISR_BRTIF9 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C9ISR_BRTIF9		(1 << 2)
/** MDMA_MDMA_C9ISR_CTCIF9 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C9ISR_CTCIF9		(1 << 1)
/** MDMA_MDMA_C9ISR_TEIF9 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C9ISR_TEIF9		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c9ifcr MDMAC9IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C9IFCR_CLTCIF9 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C9IFCR_CLTCIF9		(1 << 4)
/** MDMA_MDMA_C9IFCR_CBTIF9 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C9IFCR_CBTIF9		(1 << 3)
/** MDMA_MDMA_C9IFCR_CBRTIF9 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C9IFCR_CBRTIF9		(1 << 2)
/** MDMA_MDMA_C9IFCR_CCTCIF9 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C9IFCR_CCTCIF9		(1 << 1)
/** MDMA_MDMA_C9IFCR_CTEIF9 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C9IFCR_CTEIF9		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c9esr MDMAC9ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C9ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C9ESR_BSE		(1 << 11)
/** MDMA_MDMA_C9ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C9ESR_ASE		(1 << 10)
/** MDMA_MDMA_C9ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C9ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C9ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C9ESR_TELD		(1 << 8)
/** MDMA_MDMA_C9ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C9ESR_TED		(1 << 7)

#define MDMA_MDMA_C9ESR_TEA_SHIFT		0
#define MDMA_MDMA_C9ESR_TEA_MASK		0x7f
/** @defgroup mdma_mdma_c9esr_tea TEA Transfer Error Address These bits are set and cleared by HW, in case of an MDMA data transfer error. It is used in conjunction with TED. This field indicates the 7 LSBits of the address which generated a transfer/access error. It may be used by SW to retrieve the failing address, by adding this value (truncated to the buffer transfer length size) to the current SAR/DAR value. Note: The SAR/DAR current value doesnt reflect this last address due to the FIFO management system. The SAR/DAR are only updated at the end of a (buffer) transfer (of TLEN+1 bytes). Note: It is not set in case of a link data error.
@{*/
/**@}*/


/**@}*/

