grevaillot/svd_tools/headers/STM32H750x/mdma.h
/** @defgroup mdma_mdma_c9sar MDMAC9SAR MDMA channel x source address register
@{*/


#define MDMA_MDMA_C9SAR_SAR_SHIFT		0
#define MDMA_MDMA_C9SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c9sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c9dar MDMAC9DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C9DAR_DAR_SHIFT		0
#define MDMA_MDMA_C9DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c9dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c9brur MDMAC9BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C9BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C9BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c9brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C9BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C9BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c9brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c9lar MDMAC9LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C9LAR_LAR_SHIFT		0
#define MDMA_MDMA_C9LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c9lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c9tbr MDMAC9TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C9TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C9TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C9TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C9TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C9TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C9TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c9tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c9mar MDMAC9MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C9MAR_MAR_SHIFT		0
#define MDMA_MDMA_C9MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c9mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c9mdr MDMAC9MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C9MDR_MDR_SHIFT		0
#define MDMA_MDMA_C9MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c9mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10isr MDMAC10ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C10ISR_CRQA10 channel x request active flag **/
#define MDMA_MDMA_C10ISR_CRQA10		(1 << 16)
/** MDMA_MDMA_C10ISR_TCIF10 channel x buffer transfer complete **/
#define MDMA_MDMA_C10ISR_TCIF10		(1 << 4)
/** MDMA_MDMA_C10ISR_BTIF10 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C10ISR_BTIF10		(1 << 3)
/** MDMA_MDMA_C10ISR_BRTIF10 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C10ISR_BRTIF10		(1 << 2)
/** MDMA_MDMA_C10ISR_CTCIF10 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C10ISR_CTCIF10		(1 << 1)
/** MDMA_MDMA_C10ISR_TEIF10 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C10ISR_TEIF10		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c10ifcr MDMAC10IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C10IFCR_CLTCIF10 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C10IFCR_CLTCIF10		(1 << 4)
/** MDMA_MDMA_C10IFCR_CBTIF10 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C10IFCR_CBTIF10		(1 << 3)
/** MDMA_MDMA_C10IFCR_CBRTIF10 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C10IFCR_CBRTIF10		(1 << 2)
/** MDMA_MDMA_C10IFCR_CCTCIF10 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C10IFCR_CCTCIF10		(1 << 1)
/** MDMA_MDMA_C10IFCR_CTEIF10 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C10IFCR_CTEIF10		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c10esr MDMAC10ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C10ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C10ESR_BSE		(1 << 11)
/** MDMA_MDMA_C10ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C10ESR_ASE		(1 << 10)
/** MDMA_MDMA_C10ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C10ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C10ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C10ESR_TELD		(1 << 8)
/** MDMA_MDMA_C10ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C10ESR_TED		(1 << 7)

