grevaillot/svd_tools/headers/STM32H750x/mdma.h
#define MDMA_MDMA_C10TCR_SSIZE_SHIFT		4
#define MDMA_MDMA_C10TCR_SSIZE_MASK		0x03
/** @defgroup mdma_mdma_c10tcr_ssize SSIZE Source data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If SINCOS &lt; SSIZE and SINC &#8800; 00, the result will be unpredictable. Note: SSIZE = 11 (double-word) is forbidden when source is TCM/AHB bus (SBUS=1).
@{*/
/**@}*/


#define MDMA_MDMA_C10TCR_DINC_SHIFT		2
#define MDMA_MDMA_C10TCR_DINC_MASK		0x03
/** @defgroup mdma_mdma_c10tcr_dinc DINC Destination increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When destination is AHB (DBUS=1), DINC = 00 is forbidden.
@{*/
/**@}*/


#define MDMA_MDMA_C10TCR_SINC_SHIFT		0
#define MDMA_MDMA_C10TCR_SINC_MASK		0x03
/** @defgroup mdma_mdma_c10tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10bndtr MDMAC10BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_MDMA_C10BNDTR_BRC_SHIFT		20
#define MDMA_MDMA_C10BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_mdma_c10bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_MDMA_C10BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C10BNDTR_BRDUM		(1 << 19)
/** MDMA_MDMA_C10BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C10BNDTR_BRSUM		(1 << 18)

#define MDMA_MDMA_C10BNDTR_BNDT_SHIFT		0
#define MDMA_MDMA_C10BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_mdma_c10bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10sar MDMAC10SAR MDMA channel x source address register
@{*/


#define MDMA_MDMA_C10SAR_SAR_SHIFT		0
#define MDMA_MDMA_C10SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c10sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10dar MDMAC10DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C10DAR_DAR_SHIFT		0
#define MDMA_MDMA_C10DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c10dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10brur MDMAC10BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C10BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C10BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c10brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C10BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C10BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c10brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10lar MDMAC10LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C10LAR_LAR_SHIFT		0
#define MDMA_MDMA_C10LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c10lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10tbr MDMAC10TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C10TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C10TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C10TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C10TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C10TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C10TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c10tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10mar MDMAC10MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C10MAR_MAR_SHIFT		0
#define MDMA_MDMA_C10MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c10mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c10mdr MDMAC10MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C10MDR_MDR_SHIFT		0
#define MDMA_MDMA_C10MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c10mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c11isr MDMAC11ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C11ISR_CRQA11 channel x request active flag **/
#define MDMA_MDMA_C11ISR_CRQA11		(1 << 16)
/** MDMA_MDMA_C11ISR_TCIF11 channel x buffer transfer complete **/
#define MDMA_MDMA_C11ISR_TCIF11		(1 << 4)
/** MDMA_MDMA_C11ISR_BTIF11 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C11ISR_BTIF11		(1 << 3)
/** MDMA_MDMA_C11ISR_BRTIF11 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C11ISR_BRTIF11		(1 << 2)
/** MDMA_MDMA_C11ISR_CTCIF11 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C11ISR_CTCIF11		(1 << 1)
/** MDMA_MDMA_C11ISR_TEIF11 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C11ISR_TEIF11		(1 << 0)

/**@}*/

