grevaillot/svd_tools/headers/STM32H750x/mdma.h
/** MDMA_MDMA_C14TCR_PKE PacK Enable These bit is set and cleared by software. If the Source Size is smaller than the destination, it will be padded according to the PAM value. If the Source data size is larger than the destination one, it will be truncated. The alignment will be done according to the PAM[0] value. This bit is protected and can be written only if EN is 0 **/
#define MDMA_MDMA_C14TCR_PKE		(1 << 25)

#define MDMA_MDMA_C14TCR_TLEN_SHIFT		18
#define MDMA_MDMA_C14TCR_TLEN_MASK		0x7f
/** @defgroup mdma_mdma_c14tcr_tlen TLEN buffer transfer lengh
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_DBURST_SHIFT		15
#define MDMA_MDMA_C14TCR_DBURST_MASK		0x07
/** @defgroup mdma_mdma_c14tcr_dburst DBURST Destination burst transfer configuration
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_SBURST_SHIFT		12
#define MDMA_MDMA_C14TCR_SBURST_MASK		0x07
/** @defgroup mdma_mdma_c14tcr_sburst SBURST source burst transfer configuration
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_DINCOS_SHIFT		10
#define MDMA_MDMA_C14TCR_DINCOS_MASK		0x03
/** @defgroup mdma_mdma_c14tcr_dincos DINCOS Destination increment offset
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_SINCOS_SHIFT		8
#define MDMA_MDMA_C14TCR_SINCOS_MASK		0x03
/** @defgroup mdma_mdma_c14tcr_sincos SINCOS source increment offset size
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_DSIZE_SHIFT		6
#define MDMA_MDMA_C14TCR_DSIZE_MASK		0x03
/** @defgroup mdma_mdma_c14tcr_dsize DSIZE Destination data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0. Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If DINCOS &lt; DSIZE and DINC &#8800; 00, the result will be unpredictable. Note: DSIZE = 11 (double-word) is forbidden when destination is TCM/AHB bus (DBUS=1).
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_SSIZE_SHIFT		4
#define MDMA_MDMA_C14TCR_SSIZE_MASK		0x03
/** @defgroup mdma_mdma_c14tcr_ssize SSIZE Source data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If SINCOS &lt; SSIZE and SINC &#8800; 00, the result will be unpredictable. Note: SSIZE = 11 (double-word) is forbidden when source is TCM/AHB bus (SBUS=1).
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_DINC_SHIFT		2
#define MDMA_MDMA_C14TCR_DINC_MASK		0x03
/** @defgroup mdma_mdma_c14tcr_dinc DINC Destination increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When destination is AHB (DBUS=1), DINC = 00 is forbidden.
@{*/
/**@}*/


#define MDMA_MDMA_C14TCR_SINC_SHIFT		0
#define MDMA_MDMA_C14TCR_SINC_MASK		0x03
/** @defgroup mdma_mdma_c14tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c14bndtr MDMAC14BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_MDMA_C14BNDTR_BRC_SHIFT		20
#define MDMA_MDMA_C14BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_mdma_c14bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_MDMA_C14BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C14BNDTR_BRDUM		(1 << 19)
/** MDMA_MDMA_C14BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C14BNDTR_BRSUM		(1 << 18)

#define MDMA_MDMA_C14BNDTR_BNDT_SHIFT		0
#define MDMA_MDMA_C14BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_mdma_c14bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c14sar MDMAC14SAR MDMA channel x source address register
@{*/


#define MDMA_MDMA_C14SAR_SAR_SHIFT		0
#define MDMA_MDMA_C14SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c14sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c14dar MDMAC14DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C14DAR_DAR_SHIFT		0
#define MDMA_MDMA_C14DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c14dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c14brur MDMAC14BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C14BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C14BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c14brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C14BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C14BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c14brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c14lar MDMAC14LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C14LAR_LAR_SHIFT		0
#define MDMA_MDMA_C14LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c14lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c14tbr MDMAC14TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C14TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C14TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C14TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C14TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C14TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C14TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c14tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

