grevaillot/svd_tools/headers/STM32H750x/mdma.h
/** @defgroup mdma_mdma_c14mar MDMAC14MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C14MAR_MAR_SHIFT		0
#define MDMA_MDMA_C14MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c14mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c14mdr MDMAC14MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C14MDR_MDR_SHIFT		0
#define MDMA_MDMA_C14MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c14mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c15isr MDMAC15ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_MDMA_C15ISR_CRQA15 channel x request active flag **/
#define MDMA_MDMA_C15ISR_CRQA15		(1 << 16)
/** MDMA_MDMA_C15ISR_TCIF15 channel x buffer transfer complete **/
#define MDMA_MDMA_C15ISR_TCIF15		(1 << 4)
/** MDMA_MDMA_C15ISR_BTIF15 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C15ISR_BTIF15		(1 << 3)
/** MDMA_MDMA_C15ISR_BRTIF15 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C15ISR_BRTIF15		(1 << 2)
/** MDMA_MDMA_C15ISR_CTCIF15 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_MDMA_C15ISR_CTCIF15		(1 << 1)
/** MDMA_MDMA_C15ISR_TEIF15 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C15ISR_TEIF15		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c15ifcr MDMAC15IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_MDMA_C15IFCR_CLTCIF15 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C15IFCR_CLTCIF15		(1 << 4)
/** MDMA_MDMA_C15IFCR_CBTIF15 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C15IFCR_CBTIF15		(1 << 3)
/** MDMA_MDMA_C15IFCR_CBRTIF15 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C15IFCR_CBRTIF15		(1 << 2)
/** MDMA_MDMA_C15IFCR_CCTCIF15 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C15IFCR_CCTCIF15		(1 << 1)
/** MDMA_MDMA_C15IFCR_CTEIF15 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_MDMA_C15IFCR_CTEIF15		(1 << 0)

/**@}*/

/** @defgroup mdma_mdma_c15esr MDMAC15ESR MDMA Channel x error status register
@{*/

/** MDMA_MDMA_C15ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C15ESR_BSE		(1 << 11)
/** MDMA_MDMA_C15ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C15ESR_ASE		(1 << 10)
/** MDMA_MDMA_C15ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C15ESR_TEMD		(1 << 9)
/** MDMA_MDMA_C15ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_MDMA_C15ESR_TELD		(1 << 8)
/** MDMA_MDMA_C15ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_MDMA_C15ESR_TED		(1 << 7)

#define MDMA_MDMA_C15ESR_TEA_SHIFT		0
#define MDMA_MDMA_C15ESR_TEA_MASK		0x7f
/** @defgroup mdma_mdma_c15esr_tea TEA Transfer Error Address These bits are set and cleared by HW, in case of an MDMA data transfer error. It is used in conjunction with TED. This field indicates the 7 LSBits of the address which generated a transfer/access error. It may be used by SW to retrieve the failing address, by adding this value (truncated to the buffer transfer length size) to the current SAR/DAR value. Note: The SAR/DAR current value doesnt reflect this last address due to the FIFO management system. The SAR/DAR are only updated at the end of a (buffer) transfer (of TLEN+1 bytes). Note: It is not set in case of a link data error.
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c15cr MDMAC15CR This register is used to control the concerned channel.
@{*/

/** MDMA_MDMA_C15CR_SWRQ SW ReQuest Writing a 1 into this bit sets the CRQAx in MDMA_ISRy register, activating the request on Channel x Note: Either the whole CxCR register or the 8-bit/16-bit register @ Address offset: 0x4E + 0x40 chn may be used for SWRQ activation. In case of a SW request, acknowledge is not generated (neither HW signal, nor CxMAR write access). **/
#define MDMA_MDMA_C15CR_SWRQ		(1 << 16)
/** MDMA_MDMA_C15CR_WEX Word Endianness exchange **/
#define MDMA_MDMA_C15CR_WEX		(1 << 14)
/** MDMA_MDMA_C15CR_HEX Half word Endianes exchange **/
#define MDMA_MDMA_C15CR_HEX		(1 << 13)
/** MDMA_MDMA_C15CR_BEX byte Endianness exchange **/
#define MDMA_MDMA_C15CR_BEX		(1 << 12)

#define MDMA_MDMA_C15CR_PL_SHIFT		6
#define MDMA_MDMA_C15CR_PL_MASK		0x03
/** @defgroup mdma_mdma_c15cr_pl PL Priority level These bits are set and cleared by software. These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_MDMA_C15CR_TCIE buffer Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C15CR_TCIE		(1 << 5)
/** MDMA_MDMA_C15CR_BTIE Block Transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C15CR_BTIE		(1 << 4)
/** MDMA_MDMA_C15CR_BRTIE Block Repeat transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C15CR_BRTIE		(1 << 3)
/** MDMA_MDMA_C15CR_CTCIE Channel Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C15CR_CTCIE		(1 << 2)
/** MDMA_MDMA_C15CR_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define MDMA_MDMA_C15CR_TEIE		(1 << 1)
/** MDMA_MDMA_C15CR_EN channel enable **/
#define MDMA_MDMA_C15CR_EN		(1 << 0)

/**@}*/

