grevaillot/svd_tools/headers/STM32H750x/mdma.h
/** @defgroup mdma_mdma_c15dar MDMAC15DAR MDMA channel x destination address register
@{*/


#define MDMA_MDMA_C15DAR_DAR_SHIFT		0
#define MDMA_MDMA_C15DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c15dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c15brur MDMAC15BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_MDMA_C15BRUR_DUV_SHIFT		16
#define MDMA_MDMA_C15BRUR_DUV_MASK		0xffff
/** @defgroup mdma_mdma_c15brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_MDMA_C15BRUR_SUV_SHIFT		0
#define MDMA_MDMA_C15BRUR_SUV_MASK		0xffff
/** @defgroup mdma_mdma_c15brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c15lar MDMAC15LAR MDMA channel x Link Address register
@{*/


#define MDMA_MDMA_C15LAR_LAR_SHIFT		0
#define MDMA_MDMA_C15LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c15lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c15tbr MDMAC15TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_MDMA_C15TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C15TBR_DBUS		(1 << 17)
/** MDMA_MDMA_C15TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_MDMA_C15TBR_SBUS		(1 << 16)

#define MDMA_MDMA_C15TBR_TSEL_SHIFT		0
#define MDMA_MDMA_C15TBR_TSEL_MASK		0x3f
/** @defgroup mdma_mdma_c15tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c15mar MDMAC15MAR MDMA channel x Mask address register
@{*/


#define MDMA_MDMA_C15MAR_MAR_SHIFT		0
#define MDMA_MDMA_C15MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_mdma_c15mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_mdma_c15mdr MDMAC15MDR MDMA channel x Mask Data register
@{*/


#define MDMA_MDMA_C15MDR_MDR_SHIFT		0
#define MDMA_MDMA_C15MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_mdma_c15mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/
